
### :x: Terraform Format and Style 🎨
<details><summary>Logs</summary>
Output

```diff
main.tf
--- old/main.tf
+++ new/main.tf
@@ -1,6 +1,6 @@
 locals {
-    regions = ["us-east-2", "us-west-2", "eu-west-2"]
-    name = "tf-cosmic-12345"   
+  regions = ["us-east-2", "us-west-2", "eu-west-2"]
+  name    = "tf-cosmic-12345"
 }
 variable "bucket_regions" {
   default = {
@@ -10,14 +10,14 @@
       "repl_destination_p2" = "eu-west-2"
     },
     "us-west-2" = {
-      "region_alias"        = "aws.uswest2"  
-      repl_destination_p1   = "us-east-2"
-      repl_destination_p2   = "eu-west-2"
+      "region_alias"      = "aws.uswest2"
+      repl_destination_p1 = "us-east-2"
+      repl_destination_p2 = "eu-west-2"
     },
     "eu-west-2" = {
-      "region_alias"        = "aws.euwest2"
-      repl_destination_p1   = "us-east-2"
-      repl_destination_p2   = "us-west-2"
+      "region_alias"      = "aws.euwest2"
+      repl_destination_p1 = "us-east-2"
+      repl_destination_p2 = "us-west-2"
     }
   }
 }
@@ -45,8 +45,8 @@
   providers = {
     aws = aws.usw2
   }
-  bucket_name = local.name
-  bucket_region = "us-west-2"
+  bucket_name    = local.name
+  bucket_region  = "us-west-2"
   bucket_regions = var.bucket_regions
 }
 
@@ -55,8 +55,8 @@
   providers = {
     aws = aws.use2
   }
-  bucket_name = local.name
-  bucket_region = "us-east-2"
+  bucket_name    = local.name
+  bucket_region  = "us-east-2"
   bucket_regions = var.bucket_regions
 }
 
@@ -65,8 +65,8 @@
   providers = {
     aws = aws.euw2
   }
-  bucket_name = local.name
-  bucket_region = "eu-west-2"
+  bucket_name    = local.name
+  bucket_region  = "eu-west-2"
   bucket_regions = var.bucket_regions
 }
 

```

Errors

```

```
</details> <!-- End Format Logs -->

### :heavy_check_mark: Terraform Initialization ⚙️
<details><summary>Logs</summary>
Output

```
[0m[1mInitializing modules...[0m
- eu_west_2_bucket_module in modules/s3
- us_east_2_bucket_module in modules/s3
- us_west_2_bucket_module in modules/s3

[0m[1mInitializing the backend...[0m

[0m[1mInitializing provider plugins...[0m
- Checking for available provider plugins...
- Downloading plugin for provider "random" (hashicorp/random) 3.1.0...
- Downloading plugin for provider "aws" (hashicorp/aws) 3.32.0...

[0m[1m[32mTerraform has been successfully initialized![0m[32m[0m
[0m[32m
You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.[0m

```

Errors

```

```
</details> <!-- End Init Logs -->

### :heavy_check_mark: Terraform Validation 🤖
<details><summary>Logs</summary>
Output

```
Success! The configuration is valid.


```

Errors

```

```
</details> <!-- End Validate Logs -->

### :heavy_check_mark: Terraform Plan 📖
<details><summary>Logs</summary>

```terraform
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

module.eu_west_2_bucket_module.data.aws_iam_role.bucket_role_arn: Refreshing state...
module.us_west_2_bucket_module.data.aws_iam_role.bucket_role_arn: Refreshing state...
module.us_east_2_bucket_module.data.aws_iam_role.bucket_role_arn: Refreshing state...

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_policy.replication will be created
  + resource "aws_iam_policy" "replication" {
      + arn    = (known after apply)
      + id     = (known after apply)
      + name   = "tf-cosmic-12345"
      + path   = "/"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:ListBucket",
                          + "s3:GetReplicationConfiguration",
                          + "s3:GetObjectVersionForReplication",
                          + "s3:GetObjectVersionAcl",
                          + "s3:GetObjectVersionTagging",
                          + "s3:GetObjectRetention",
                          + "s3:GetObjectLegalHold",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::tf-cosmic-12345-us-west-2",
                          + "arn:aws:s3:::tf-cosmic-12345-us-west-2/*",
                          + "arn:aws:s3:::tf-cosmic-12345-us-east-2",
                          + "arn:aws:s3:::tf-cosmic-12345-us-east-2/*",
                          + "arn:aws:s3:::tf-cosmic-12345-eu-west-2",
                          + "arn:aws:s3:::tf-cosmic-12345-eu-west-2/*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "s3:ReplicateObject",
                          + "s3:ReplicateDelete",
                          + "s3:ReplicateTags",
                          + "s3:ObjectOwnerOverrideToBucketOwner",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::tf-cosmic-12345-us-west-2/*",
                          + "arn:aws:s3:::tf-cosmic-12345-us-east-2/*",
                          + "arn:aws:s3:::tf-cosmic-12345-eu-west-2/*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # aws_iam_policy_attachment.replication will be created
  + resource "aws_iam_policy_attachment" "replication" {
      + id         = (known after apply)
      + name       = "tf-cosmic-12345"
      + policy_arn = (known after apply)
      + roles      = [
          + "tf-cosmic-12345",
        ]
    }

  # aws_iam_role.replication will be created
  + resource "aws_iam_role" "replication" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "s3.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "tf-cosmic-12345"
      + path                  = "/"
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.eu_west_2_bucket_module.aws_s3_bucket.bucket will be created
  + resource "aws_s3_bucket" "bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "tf-cosmic-12345-eu-west-2"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + replication_configuration {
          + role = "arn:aws:iam::473648414978:role/tf-cosmic-12345"

          + rules {
              + id       = "repl-rule-eu-west-2-to-us-east-2"
              + priority = 0
              + status   = "Enabled"

              + destination {
                  + bucket        = "arn:aws:s3:::tf-cosmic-12345-us-east-2"
                  + storage_class = "STANDARD"
                }

              + filter {}
            }
          + rules {
              + id       = "repl-rule-eu-west-2-to-us-west-2"
              + priority = 1
              + status   = "Enabled"

              + destination {
                  + bucket        = "arn:aws:s3:::tf-cosmic-12345-us-west-2"
                  + storage_class = "STANDARD"
                }

              + filter {}
            }
        }

      + versioning {
          + enabled    = true
          + mfa_delete = false
        }
    }

  # module.us_east_2_bucket_module.aws_s3_bucket.bucket will be created
  + resource "aws_s3_bucket" "bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "tf-cosmic-12345-us-west-2"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + replication_configuration {
          + role = "arn:aws:iam::473648414978:role/tf-cosmic-12345"

          + rules {
              + id       = "repl-rule-us-west-2-to-eu-west-2"
              + priority = 1
              + status   = "Enabled"

              + destination {
                  + bucket        = "arn:aws:s3:::tf-cosmic-12345-eu-west-2"
                  + storage_class = "STANDARD"
                }

              + filter {}
            }
          + rules {
              + id       = "repl-rule-us-west-2-to-us-east-2"
              + priority = 0
              + status   = "Enabled"

              + destination {
                  + bucket        = "arn:aws:s3:::tf-cosmic-12345-us-east-2"
                  + storage_class = "STANDARD"
                }

              + filter {}
            }
        }

      + versioning {
          + enabled    = true
          + mfa_delete = false
        }
    }

  # module.us_west_2_bucket_module.aws_s3_bucket.bucket will be created
  + resource "aws_s3_bucket" "bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "tf-cosmic-12345-us-east-2"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + replication_configuration {
          + role = "arn:aws:iam::473648414978:role/tf-cosmic-12345"

          + rules {
              + id       = "repl-rule-us-east-2-to-eu-west-2"
              + priority = 1
              + status   = "Enabled"

              + destination {
                  + bucket        = "arn:aws:s3:::tf-cosmic-12345-eu-west-2"
                  + storage_class = "STANDARD"
                }

              + filter {}
            }
          + rules {
              + id       = "repl-rule-us-east-2-to-us-west-2"
              + priority = 0
              + status   = "Enabled"

              + destination {
                  + bucket        = "arn:aws:s3:::tf-cosmic-12345-us-west-2"
                  + storage_class = "STANDARD"
                }

              + filter {}
            }
        }

      + versioning {
          + enabled    = true
          + mfa_delete = false
        }
    }

Plan: 6 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.


```
</details>

*Pusher: @macneib, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform`*